[
  {
    "sourceId": "SECUREX_ORCHESTRATION",
    "title": "SecureX Orchestration out of Beta",
    "link": "\/orchestration",
    "summary": "SecureX Orchestration is now Generally Available, and even more powerful with the two newly released workflows - Phishing and SolarWinds.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "SECUREX_CHROME_EXTENSION",
    "title": "Get SecureX Ribbon for Chrome",
    "link": "http://cs.co/SecureX_Chrome",
    "summary": "Add the new Ribbon extension to Chrome to kick off your investigations from any browser-based tool or intel blog source, and maintain context wherever you go.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "SECUREX_FIREFOX_ADD_ON",
    "title": "Get SecureX Ribbon for Firefox",
    "link": "http://cs.co/SecureX_Firefox",
    "summary": "Add the new Ribbon add-on to Firefox to accelerate incident response workflows, and improve threat hunting directly from your browser.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "SECUREX_WEBINARS_AND_TRAINING",
    "title": "SecureX Webinars & Training Videos",
    "link": "https://learningnetwork.cisco.com/s/securex-training-videos",
    "summary": "Join Cisco experts in December & January for these live sessions: \"Feature Deep Dive: Custom Security Events\" and \"ISE 3.0 - Posture & Compliance\"",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "FireEye Breach Detection Guidance",
    "link": "https://blog.talosintelligence.com/2020/12/fireeye-breach-guidance.html",
    "summary": "Cyber security firm FireEye recently disclosed an incident that was reported to have resulted in the inadvertent disclosure of various internally developed offensive security tools (OSTs) that were used across FireEye red-team engagements.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Tips to improve your security program in 2021",
    "link": "https://blogs.cisco.com/security/tips-to-improve-your-security-program-in-2021",
    "summary": "With organizations demanding more agility in the way business is run, the security function has an increasing need to keep up with change. The reasons are all well known. Technology change drives business change, and vice versa, in an increasingly dynamic merry-go-round. Security has to underpin this change to support business outcomes.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Threat Advisory: SolarWinds supply chain attack",
    "link": "https://blog.talosintelligence.com/2020/12/solarwinds-supplychain-coverage.html",
    "summary": "Cisco Talos is monitoring yesterday's announcements by FireEye and Microsoft that a likely state-sponsored actor compromised potentially thousands of high-value government and private organizations around the world via the SolarWinds Orion product.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Introducing the new Secure Cloud Analytics event viewer!",
    "link": "https://blogs.cisco.com/security/introducing-the-new-secure-cloud-analytics-event-viewer",
    "summary": "The event viewer is essentially the first phase of our CSPM release that was recently announced. It provides a look at all of your network traffic with the ability to filter through these connections with ease. This simplifies forensic analysis and grants customers the ability to analyze traffic for threat detection and compliance purposes in near real time.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Microsoft Releases December 2020 Security Updates",
    "link": "https://us-cert.cisa.gov/ncas/current-activity/2020/12/08/microsoft-releases-december-2020-security-updates",
    "summary": "Microsoft has released updates to address vulnerabilities in Microsoft software. A remote attacker could exploit some of these vulnerabilities to take control of an affected system.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Threat Roundup for December 4 to December 11",
    "link": "https://blog.talosintelligence.com/2020/12/threat-roundup-1204-1211.html",
    "summary": "Today, Talos is publishing a glimpse into the most prevalent threats we've observed between Dec. 4 and Dec. 11. As with previous roundups, this post isn't meant to be an in-depth analysis. Instead, this post will summarize the threats...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "National Cyber Security Centre Cyber Awareness Campaign",
    "link": "https://us-cert.cisa.gov/ncas/current-activity/2020/12/09/national-cyber-security-centre-cyber-awareness-campaign",
    "summary": "The United Kingdom (UK) National Cyber Security Centre (NCSC) has launched a new cyber security campaign encouraging the public to adopt six behaviors to stay safe online. The six Cyber Aware behaviors recommended by the NSCS are...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "EDR. NDR? XDR!... is it more than just marketing?",
    "link": "https://blogs.cisco.com/security/edr-ndr-xdr-is-it-more-than-just-marketing",
    "summary": "As is often true with new security concepts, vendors are quickly adopting the new terminology to showcase their products’ capabilities. This is where things get confusing and tricky. Some vendors are using XDR (Extended Detection & Response) as a marketing strategy for their existing EDR...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_DEVNET",
    "title": "New SecureX Microsite on Devnet",
    "link": "https://developer.cisco.com/securex/",
    "summary": "For users who want to extend SecureX capabilities by using the available APIs or writing their own orchestration workflows, we have launched a new SecureX Devnet Microsite. This resource is a valuable collection of links to relevant blogs, videos, training, and code examples...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Cisco Talos Advisory on Adversaries Targeting the Healthcare and Public Health Sector",
    "link": "https://blog.talosintelligence.com/2020/10/healthcare-advisory.html",
    "summary": "Cisco Talos has become aware that an adversary is leveraging Trickbot banking trojan and Ryuk ransomware to target U.S. hospitals and healthcare providers at an increasing rate...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "CISA and CNMF Identify a New Malware Variant: Zebrocy",
    "link": "https://us-cert.cisa.gov/ncas/current-activity/2020/10/29/cisa-and-cnmf-identify-new-malware-variant-zebrocy",
    "summary": "CISA and the DOD have identified a malware variant - referred to as Zebrocy - used by a sophisticated cyber actor. In addition, U.S. Cyber Command has released the malware sample to the malware aggregation tool and repository, VirusTotal.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "\"Are we affected?\" - A simple question, but quite hard to answer",
    "link": "https://blogs.cisco.com/security/are-we-affected-a-simple-question-but-quite-hard-to-answer",
    "summary": "Why it's so difficult in the year 2020 (only a couple of days to go until 2021), with 30+ security tools in place, to answer that question? Due to the volume of threats that are out there, it's not possible to find an easy answer. You have to check vulnerability databases...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "CISA, FBI, and CNMF Identify a New Malware Variant: ComRAT",
    "link": "https://us-cert.cisa.gov/ncas/current-activity/2020/10/29/cisa-fbi-and-cnmf-identify-new-malware-variant-comrat",
    "summary": "A malware variant - referred to as ComRAT - is used by the Russian-sponsored advanced persistent threat (APT) actor Turla. U.S. Cyber Command has released the malware sample to the malware aggregation tool and repository, VirusTotal.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Stop playing whack-a-mole and put threats to rest with Cisco Stealthwatch Cloud",
    "link": "https://blogs.cisco.com/security/stop-playing-whack-a-mole-and-put-threats-to-rest-with-cisco-stealthwatch-cloud",
    "summary": "I was recently able to grab some time with a Cisco customer to hear about their experience with Cisco Stealthwatch Cloud, a SaaS-based Network Detection and Response (NDR) solution. Aspire Technology Partners, a Managed Security Service Provider, explained their use of the product...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Lemon Duck brings cryptocurrency miners back into the spotlight",
    "link": "https://blog.talosintelligence.com/2020/10/lemon-duck-brings-cryptocurrency-miners.html",
    "summary": "Cisco Talos recently discovered a complex campaign employing a multi-modular botnet with multiple ways to spread. This threat, known as \"Lemon Duck,\" has a cryptocurrency mining payload that steals computer resources...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "NSA Releases Advisory on Chinese State-Sponsored Actors Exploiting Publicly Known Vulnerabilities",
    "link": "https://us-cert.cisa.gov/ncas/current-activity/2020/10/20/nsa-releases-advisory-chinese-state-sponsored-actors-exploiting",
    "summary": "This advisory provides 25 Common Vulnerabilities and Exposures (CVEs) known to be recently leveraged, or scanned-for, by Chinese state-sponsored cyber actors to enable successful hacking operations against a multitude of victim networks.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Threat Landscape Trends: Endpoint Security, Part 2",
    "link": "https://blogs.cisco.com/security/threat-landscape-trends-endpoint-security-part-2",
    "summary": "Watching the trends is so important: it provides a view of what you're most likely to encounter. This is the purpose of this new blog series, Threat Landscape Trends. In it, we'll be taking a look at activity in the threat landscape...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Threat Roundup for October 2 to October 9",
    "link": "https://blog.talosintelligence.com/2020/10/threat-roundup-1002-1009.html",
    "summary": "Today, Talos is publishing a glimpse into the most prevalent threats we've observed between Oct. 2 and Oct. 9. As with previous roundups, this post isn't meant to be an in-depth analysis...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "PoetRAT: Malware targeting public and private sector in Azerbaijan evolves",
    "link": "https://blog.talosintelligence.com/2020/10/poetrat-update.html",
    "summary": "Cisco Talos discovered PoetRAT earlier this year. We have continued to monitor this actor and their behavior over the preceding months. We have observed multiple new campaigns indicating a change in the actor's capabilities...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Microsoft Releases Security Updates to Address RCE Vulnerabilities",
    "link": "https://us-cert.cisa.gov/ncas/current-activity/2020/10/16/microsoft-releases-security-updates-address-remote-code-execution",
    "summary": "The Cybersecurity and Infrastructure Security Agency (CISA) encourages users and administrators to review the Microsoft security advisories for CVE-2020-17022 and CVE-2020-17023 and apply the necessary updates.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "The million-dollar question: Is Cisco SecureX the same as XDR?",
    "link": "https://blogs.cisco.com/security/the-million-dollar-question-is-cisco-securex-the-same-as-xdr",
    "summary": "Matching XDR solutions, the SecureX platform integrates technology together with true turnkey interoperability - whether Cisco security products or third parties - for extended detection and response beyond the endpoint to also the network, cloud edge, and applications with firewall, analytics, email security...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Automated response with Cisco Stealthwatch",
    "link": "https://blogs.cisco.com/security/automated-response-with-cisco-stealthwatch",
    "summary": "In release 7.3, the Response Management module has been modernized and is now available from the web-based user interface to facilitate data-sharing with third party event gathering and ticketing systems. Additional enhancements include a range of customizable action and rule configurations...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Threat Roundup for September 18 to September 25",
    "link": "https://blog.talosintelligence.com/2020/09/threat-roundup-0918-0925.html",
    "summary": "The most prevalent threats highlighted in this roundup are: ZeroAccess is a trojan that infects Windows systems, installing a rootkit to hide its presence on the affected machine and serves as a platform for conducting click fraud campaigns...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "2020 CWE Top 25 Most Dangerous Software Weaknesses",
    "link": "https://us-cert.cisa.gov/ncas/current-activity/2020/08/20/2020-cwe-top-25-most-dangerous-software-weaknesses",
    "summary": "The Homeland Security Systems Engineering and Development Institute, sponsored by the Department of Homeland Security and operated by MITRE, has released the 2020 Common Weakness Enumeration (CWE) Top 25 Most Dangerous Software Weaknesses list.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Salfram: Robbing the place without removing your name tag",
    "link": "https://blog.talosintelligence.com/2020/09/salfram-robbing-place-without-removing.html",
    "summary": "Over the past several months, Cisco Talos has seen attackers carrying out ongoing email-based malware distribution campaigns to distribute various malware payloads. These email campaigns feature several notable characteristics that appear designed to evade detection and maximize the effectiveness of these campaigns.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Quarterly Report: Incident Response trends in Summer 2020",
    "link": "https://blog.talosintelligence.com/2020/09/CTIR-quarterly-trends-Q4-2020.html",
    "summary": "For the fifth quarter in a row, Cisco Talos Incident Response (CTIR) observed ransomware dominating the threat landscape. Infections involved a wide variety of malware families including Ryuk, Maze, LockBit, and Netwalker, among others.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Tame the wilderness of remote access and answer the call of the mobility",
    "link": "https://blogs.cisco.com/security/tame-the-wilderness-of-remote-access-and-answer-the-call-of-the-mobility",
    "summary": "In the early spring, organizations around the world were forced to adapt or face extinction. In haste, we answered the demand for remote access. And like most things done in haste, we may have forgone the details that will protect us in the near future. Increasingly we saw customers sacrifice their organizational policies...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "MITRE ATT&CK: The Magic of Mitigations",
    "link": "https://blogs.cisco.com/security/mitre-attck-the-magic-of-mitigations",
    "summary": "If you're just getting started with ATT&CK, I highly recommend looking at Mitigations first. You can assess your program and discover weaknesses with them. Then you can talk about your priorities with vendors who also speak ATT&CK.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Joint NSA and FBI Cybersecurity Advisory Discloses Russian Malware Drovorub",
    "link": "https://us-cert.cisa.gov/ncas/current-activity/2020/08/13/joint-nsa-and-fbi-cybersecurity-advisory-discloses-russian-malware",
    "summary": "The National Security Agency (NSA) and the Federal Bureau of Investigation (FBI) have released a cybersecurity advisory introducing previously undisclosed Russian malware. NSA and the FBI attributed the malware, dubbed Drovorub, to Russian advanced persistent threat (APT) actors.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Microsoft Addresses RCE and Spoofing Vulnerabilities Under Active Exploitation",
    "link": "https://us-cert.cisa.gov/ncas/current-activity/2020/08/11/microsoft-addresses-rce-and-spoofing-vulnerabilities-under-active",
    "summary": "Microsoft has released security updates to address two vulnerabilities - CVE-2020-1380 and CVE-2020-1464 - that are being actively exploited. CVE-2020-1380 is a remote code execution vulnerability affecting Internet Explorer 11, and CVE-2020-1464 is a spoofing vulnerability that affects multiple Windows products.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Vulnerability Spotlight: Multiple SQL, code injection vulnerabilities in OpenSIS",
    "link": "https://blog.talosintelligence.com/2020/08/vuln-spotlight-opensis-aug-2020.html",
    "summary": "Cisco Talos researchers recently discovered multiple vulnerabilities in the OpenSIS software family. OpenSIS is a student information management system for K-12 students. It is available in commercial and open-source versions and allows schools to create schedules and track attendance, grades and transcripts.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Vulnerability Spotlight: Remote code execution, privilege escalation bugs in Microsoft Azure Sphere",
    "link": "https://blog.talosintelligence.com/2020/08/vuln-spotlight-microsoft-azure-aug-2020.html",
    "summary": "Cisco Talos researchers recently discovered multiple vulnerabilities in Microsoft's Azure Sphere, a cloud-connected and custom SoC platform designed specifically with IoT application security in mind. Internally, the SoC is made up of a set of several ARM cores that have different roles...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Chinese Malicious Cyber Activity",
    "link": "https://us-cert.cisa.gov/china",
    "summary": "The information contained on this page is the result of analytic efforts of the Cybersecurity and Infrastructure Security Agency (CISA) to provide technical details on the tactics, techniques, and procedures used by People's Republic of China (PRC) cyber threat actors.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Securing Remote Work: Questions You Should Ask",
    "link": "https://blogs.cisco.com/security/securing-remote-work-questions-you-should-ask",
    "summary": "No one could have anticipated the overnight need to rapidly pivot from working in an office to working remotely. Today, 76% of employees are working from home, needing remote access to corporate systems from all sorts of devices from unknown, potentially unsecure home networks. But with 68% of breaches originating on endpoints and bad actors intensifying...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Intelligence, Modelling and Hunting Through an ATT&CKers Lens",
    "link": "https://blogs.cisco.com/security/intelligence-modelling-and-hunting-through-an-attckers-lens",
    "summary": "Unless you've been asleep recently, you'll probably be aware of MITRE's ATT&CK framework. This is a game changer for defenders as it maps out the common threats that an enterprise will face. ATT&CK aligns this to protective and detective controls and allows everyone within the enterprise to speak a common language on how attackers might move through an infrastructure.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Threat Roundup for August 14 to August 21",
    "link": "https://blog.talosintelligence.com/2020/08/threat-roundup-0814-0821.html",
    "summary": "Today, Talos is publishing a glimpse into the most prevalent threats we've observed between Aug. 14 and Aug. 21. As with previous roundups, this post isn't meant to be an in-depth analysis. Instead, this post will summarize the threats we've observed by highlighting key behavioral characteristics, indicators of compromise...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Phishing Emails Used to Deploy KONNI Malware",
    "link": "https://us-cert.cisa.gov/ncas/alerts/aa20-227a",
    "summary": "The Cybersecurity and Infrastructure Security Agency (CISA) has observed cyber actors using emails containing a Microsoft Word document with a malicious Visual Basic Application (VBA) macro code to deploy KONNI malware. KONNI is a remote administration tool (RAT) used by malicious cyber actors to steal files, capture keystrokes, take screenshots, and execute arbitrary code on infected hosts.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Apple Releases Security Updates for iCloud for Windows",
    "link": "https://us-cert.cisa.gov/ncas/current-activity/2020/08/11/apple-releases-security-updates-icloud-windows",
    "summary": "Apple has released security updates to address vulnerabilities in iCloud for Windows 7.20 (for Windows 7 and later) and 11.3 (for Windows 10 and later). An attacker could exploit some of these vulnerabilities to take control of an affected system.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Vulnerability Spotlight: Internet Systems Consortium BIND server DoS",
    "link": "https://blog.talosintelligence.com/2020/08/vuln-spotlight-ISC-BIND-aug-2020.html",
    "summary": "The Internet Systems Consortium's BIND server contains a denial-of-service vulnerability that exists when processing TCP traffic through the libuv library. An attacker can exploit this vulnerability by flooding the TCP port and forcing the service to terminate.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Adapting to a New Way of Working in 2020",
    "link": "https://blogs.cisco.com/security/adapting-to-a-new-way-of-working-in-2020",
    "summary": "In the spring of 2020, organizations sought to protect their workforce by mandating and enabling their employees to work from home. While necessary for saving lives, this experience physically separated security professionals from their own teams, from the employees who depend on them, and from the systems they're responsible for. The new work arrangement also placed greater strain...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "What is application-first security?",
    "link": "https://blogs.cisco.com/security/what-is-application-first-security",
    "summary": "Application-first security is the idea that applications are critical to running businesses and operations - they must be secured because they drive business value, but they run everywhere and are constantly being updated. The nature of applications is what makes them hard to secure. There are 3 stages in the application life cycle: development, deployment and testing, and runtime...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "NSA Releases Guidance on Limiting Location Data Exposure",
    "link": "https://us-cert.cisa.gov/ncas/current-activity/2020/08/06/nsa-releases-guidance-limiting-location-data-exposure",
    "summary": "The National Security Agency (NSA) has released an information sheet with guidance on how to limit location data exposure for National Security System (NSS) / Department of Defense (DoD) system users, as well as the general public. NSA outlines mobile device geolocation services and provides recommendations on how to prevent the exposure...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Threat Roundup for August 7 to August 14",
    "link": "https://blog.talosintelligence.com/2020/08/threat-roundup-0807-0814.html",
    "summary": "Today, Talos is publishing a glimpse into the most prevalent threats we've observed between Aug. 7 and Aug. 14. As with previous roundups, this post isn't meant to be an in-depth analysis. Instead, this post will summarize the threats we've observed by highlighting key behavioral characteristics, indicators of compromise...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "SecureX threat response ecosystem",
    "link": "https://blogs.cisco.com/security/securex-threat-response-ecosystem",
    "summary": "With SecureX, you can accelerate threat hunting and incident response by seamlessly integrating SecureX threat response and your existing security technologies. You have the flexibility to bring your tools together, whether it's with integrations that are built-in, pre-packaged, or custom.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "\"Don't fire the CISO\", with Quentyn Taylor",
    "link": "https://blogs.cisco.com/security/dont-fire-the-ciso-with-quentyn-taylor",
    "summary": "Our guest on the Security Stories podcast is Quentyn Taylor, CISO for Canon Europe. He shares his journey, as well as Canon's customer-centric approach to security, coping with the \"virtual hurdle\" with his team, and what exactly goes into making the perfect cocktail.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Threat Roundup for July 24 to July 31",
    "link": "https://blog.talosintelligence.com/2020/07/threat-roundup-0724-0731.html",
    "summary": "Today, Talos is publishing a glimpse into the most prevalent threats we've observed between July 24 and July 31. As with previous roundups, this post isn't meant to be an in-depth analysis. Instead, this post will summarize the threats we've observed by highlighting key behavioral characteristics, indicators of compromise...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "CISA Releases Emergency Directive on Critical Microsoft Vulnerability",
    "link": "https://us-cert.cisa.gov/ncas/current-activity/2020/07/16/cisa-releases-emergency-directive-critical-microsoft-vulnerability",
    "summary": "CISA has released Emergency Directive 20-03 addressing a critical vulnerability - CVE-2020-1350 - affecting all versions of Windows Server with the Domain Name System (DNS) role enabled. A remote attacker could exploit this vulnerability to take control of an affected system.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Adversarial use of current events as lures",
    "link": "https://blog.talosintelligence.com/2020/07/current-events-lures.html",
    "summary": "In today's world, everyone's thoughts immediately go to COVID-19 and Black Lives Matter, since both stories have dominated the threat landscape over the last several months, but this is something that organically happens frequently on the threat landscape. So much so that organizations should include it in their threat hunting activities. This blog is going to walk through the why and how.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "CISOs share their stories",
    "link": "https://blogs.cisco.com/security/cisos-share-their-stories",
    "summary": "Our Security Stories podcast has captured some fascinating insights from CISOs. In this blog, our host Hazel recalls some of the leadership stories that have left their mark on her the most.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Securing Remote Work: Protecting Endpoints the Right Way",
    "link": "https://blogs.cisco.com/security/securing-remote-work-protecting-endpoints-the-right-way",
    "summary": "Protecting the remote work environment is critical. Cisco's Endpoint Security solution defends your remote workforce by blocking attacks at the endpoint before compromise, while helping you respond to threats quickly and completely.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Microsoft Addresses 'Wormable' RCE Vulnerability in Windows DNS Server",
    "link": "https://us-cert.cisa.gov/ncas/current-activity/2020/07/14/microsoft-addresses-wormable-rce-vulnerability-windows-dns-server",
    "summary": "Microsoft has released a security update to address a remote code execution (RCE) vulnerability - CVE-2020-1350 - in Windows DNS Server. A remote attacker could exploit this vulnerability to take control of an affected system. This is considered a \"wormable\" vulnerability that affects all Windows Server versions.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Prometei botnet and its quest for Monero",
    "link": "https://blog.talosintelligence.com/2020/07/prometei-botnet-and-its-quest-for-monero.html",
    "summary": "Cisco Talos recently discovered a complex campaign employing a multi-modular botnet with multiple ways to spread and a payload focused on providing financial benefits for the attacker by mining the Monero online currency.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "The Hunt for the Most Dangerous Cyber Criminals",
    "link": "https://blogs.cisco.com/security/the-hunt-for-the-most-dangerous-cyber-criminals",
    "summary": "Learn more about the story behind the hunt for the most dangerous hackers, with investigative journalist Andy Greenberg and the Cisco Talos threat investigation team.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Microsoft Releases July 2020 Security Updates",
    "link": "https://us-cert.cisa.gov/ncas/current-activity/2020/07/14/microsoft-releases-july-2020-security-updates",
    "summary": "Microsoft has released updates to address multiple vulnerabilities in Microsoft software. A remote attacker could exploit some of these vulnerabilities to take control of an affected system.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Vulnerability Spotlight: SQL injection vulnerability in Glacies IceHRM",
    "link": "https://blog.talosintelligence.com/2020/07/vuln-spotlight-icehrm-sql-injection-july-2020.html",
    "summary": "Cisco Talos researchers recently discovered that the Glacies' IceHRM software contains a vulnerability that could allow an adversary to inject SQL. An attacker could send the software a specially crafted HTTP request, which can open the door for SQL injection.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "SMB Myth Busting: Do smaller organizations face different cyberattacks?",
    "link": "https://blogs.cisco.com/security/smb-myth-busting-do-smaller-organizations-face-different-cyberattacks",
    "summary": "In this week's SMB myth busting discussion, Hazel Burton, Cisco Advisory CISO Wolf Goerlich, and Elevate Security co-founder Masha Sedova examine the SMB threat landscape with a focus on phishing.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "FTC Releases Article on Protecting Small Businesses from Cyber Threats",
    "link": "https://us-cert.cisa.gov/ncas/current-activity/2020/07/13/ftc-releases-article-protecting-small-businesses-cyber-threats",
    "summary": "The Federal Trade Commission (FTC) has released an article on their Protecting Small Business playlist, which is a collection of videos with tips for small businesses to protect their networks from common cyber scams and cyberattacks.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "New Snort rule addresses critical vulnerability in F5 BIG-IP",
    "link": "https://blog.talosintelligence.com/2020/07/snort-rule-f5-rce-critical-vuln.html",
    "summary": "BIG-IP is one of the most popular networking products on the modern market. This product is used to shape web traffic, access gateways, limit rates and much more. F5 disclosed a remote code execution over the weekend that was assigned a maximum 10 out of 10 severity score.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Getting more value from your endpoint security tool #4: Querying Tips for IT Operations",
    "link": "https://blogs.cisco.com/security/getting-more-value-from-your-endpoint-security-tool-4-querying-tips-for-it-operations",
    "summary": "Orbital Advanced Search has an entire category dedicated to Posture Assessments which contains queries to check CPU data, network host connections, operating system information, installed programs, and more.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Cisco and Amazon Web Services (AWS) Work Together to Accelerate Cloud Adoption",
    "link": "https://blogs.cisco.com/security/cisco-and-amazon-web-services-aws-work-together-to-accelerate-cloud-adoption",
    "summary": "While application developers enjoy the tremendous agility and flexibility of the cloud, the Cisco 2020 CISO Benchmark Report shows that many organizations still cite public cloud infrastructure as a \"top security challenge,\" with 52% of respondents stating they view their cloud environment as \"very or extremely challenging to secure.\"",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "WastedLocker Goes \"Big-Game Hunting\" in 2020",
    "link": "https://blog.talosintelligence.com/2020/07/wastedlocker-emerges.html",
    "summary": "After initially compromising corporate networks, the attacker behind WastedLocker performs privilege escalation and lateral movement prior to activating ransomware and demanding ransom payment. The use of \"dual-use\" tools and \"LoLBins\" enables adversaries to evade detection...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Vulnerability Spotlight: Information disclosure vulnerability in Mozilla Firefox",
    "link": "https://blog.talosintelligence.com/2020/07/vuln-spotlight-firefox-information-leak-july-2020.html",
    "summary": "Cisco Talos recently discovered an information disclosure vulnerability in Mozilla Firefox. An attacker can exploit this bug by tricking a user into visiting a specially crafted web page through the browser. If successful, the adversary could use leaked memory to bypass ASLR and...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Top 10 Routinely Exploited Vulnerabilities",
    "link": "https://www.us-cert.gov/ncas/alerts/aa20-133a",
    "summary": "According to U.S. Government technical analysis, malicious cyber actors most often exploited vulnerabilities in Microsoft's Object Linking and Embedding (OLE) technology. OLE allows documents to contain...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "When it comes to security, how many vendors is too many?",
    "link": "https://blogs.cisco.com/security/when-it-comes-to-security-how-many-vendors-is-too-many",
    "summary": "If you're like many other organizations today, you're getting inundated with alerts, have too many interfaces to pay attention to, and wish to secure your environment with fewer vendors.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Threat Spotlight: Valak Slithers Its Way Into Manufacturing and Transportation Networks",
    "link": "https://blog.talosintelligence.com/2020/07/valak-emerges.html",
    "summary": "Attackers are actively distributing the Valak malware family around the globe, with enterprises, in particular, being targeted. These campaigns make use of existing email threads from compromised accounts to greatly increase success.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Microsoft Releases Security Updates for Windows 10, Windows Server",
    "link": "https://www.us-cert.gov/ncas/current-activity/2020/07/01/microsoft-releases-security-updates-windows-10-windows-server",
    "summary": "Microsoft has released security updates to address vulnerabilities in Windows 10 and Windows Server. These vulnerabilities could allow a remote attacker to take control of an affected system.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Vulnerability Spotlight: Google Chrome PDFium memory corruption vulnerability",
    "link": "https://blog.talosintelligence.com/2020/07/vuln-spotlight-chrome-pdfium-corruption-july-2020.html",
    "summary": "The PDF renderer inside Google Chrome, known as PDFium, contains a memory corruption vulnerability that could be exploited by an adversary.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Querying Tips for Incident Investigation",
    "link": "https://blogs.cisco.com/security/getting-more-value-from-your-endpoint-security-tool-3-querying-tips-for-incident-investigation",
    "summary": "As a feature in Cisco's AMP for Endpoints Advantage, Orbital Advanced Search is the \"correct tool\" for Incident Investigation. Orbital Advanced Search has an entire category dedicated to Forensics, which contains queries to collect data such as installed programs on the host, types of failed login attempts, operating system attributes, and more.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "The impact of a diverse cybersecurity team",
    "link": "https://blogs.cisco.com/security/the-impact-of-a-diverse-cybersecurity-team",
    "summary": "In the latest episode of the Security Stories podcast, we meet the wonderful Marene Allison. She will shortly be celebrating her ten year anniversary as Vice President and CISO for Johnson & Johnson.  With more than 260 companies in 60 countries worldwide, J & J is a...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Apache Releases Security Advisory for Apache Tomcat",
    "link": "https://www.us-cert.gov/ncas/current-activity/2020/06/26/apache-releases-security-advisory-apache-tomcat",
    "summary": "The Apache Software Foundation has released a security advisory to address a vulnerability in Apache Tomcat. An attacker could exploit this vulnerability to cause a denial-of-service condition.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Threat Roundup for June 19 to June 26",
    "link": "https://blog.talosintelligence.com/2020/06/threat-roundup-0619-0626.html",
    "summary": "For each threat described, this blog post lists 25 of the associated file hashes and up to 25 IOCs for each category. An accompanying JSON file can be found that includes the complete list of file hashes, as well as all other IOCs from this post.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "APT Groups Target Healthcare and Essential Services",
    "link": "https://www.us-cert.gov/ncas/alerts/AA20126A",
    "summary": "CISA and NCSC continue to see indications that advanced persistent threat (APT) groups are exploiting the Coronavirus Disease 2019 (COVID-19) pandemic as part of their cyber operations.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Under the Hood of a Security Platform",
    "link": "https://blogs.cisco.com/security/under-the-hood-of-a-security-platform",
    "summary": "A true security platform should: 1) Bring together an established, comprehensive set of security capabilities that are made better through integration. 2) Include strong, out-of-the-box integrations that require minimal or no effort on the part of customers. 3) Be free or low cost...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Introducing Cisco AMP for Endpoints - Premier",
    "link": "https://blogs.cisco.com/security/introducing-cisco-amp-for-endpoints-premier",
    "summary": "Our new threat hunting feature combines our Orbital Advanced Search feature with expertise from elite threat hunters to proactively find more sophisticated threats. Once threats are detected, customers are notified within their AMP Console, so they can begin remediation...",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Vulnerability Spotlight: Denial-of-service vulnerability in NVIDIA driver",
    "link": "https://blog.talosintelligence.com/2020/06/vuln-spotlight-nvidia-dos-june-2020.html",
    "summary": "The NVWGF2UMX_CFG.DLL driver contains a denial-of-service vulnerability that an attacker could use to disrupt processes over a virtual machine. An adversary could exploit this bug by providing a specially crafted pixel shader over VMware guests and VMware hosts, leading to VMware to process crash on the host machine.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Microsoft Office 365 Security Recommendations",
    "link": "https://www.us-cert.gov/ncas/alerts/aa20-120a",
    "summary": "This Alert is an update to the Cybersecurity and Infrastructure Security Agency's May 2019 Analysis Report, AR19-133A: Microsoft Office 365 Security Observations, and reiterates the recommendations related to O365 for organizations to review and ensure their newly adopted environment is configured to protect, detect, and respond against would be attackers of O365.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Securing the remote work environment",
    "link": "https://blogs.cisco.com/security/securing-the-remote-work-environment",
    "summary": "As organizations adopt remote working, how should they evaluate their security posture? And what are the top threats they may face?",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Threat Roundup for May 1 to May 8",
    "link": "https://blog.talosintelligence.com/2020/05/threat-roundup-0501-0508.html",
    "summary": "Today, Talos is publishing a glimpse into the most prevalent threats we've observed between May 1 and May 8. As with previous roundups, this post isn't meant to be an in-depth analysis. Instead, this post will summarize the threats we've observed by highlighting key behavioral characteristics, indicators of compromise, and discussing how our customers are automatically protected from these threats.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Vulnerability Spotlight: Remote code execution vulnerabilities in Adobe Acrobat Reader",
    "link": "https://blog.talosintelligence.com/2020/05/vulnerability-spotlight-remote-code.html",
    "summary": "Cisco Talos recently discovered two remote code execution vulnerabilities in Adobe Acrobat Reader. Acrobat supports a number of features, including the ability to process embedded JavaScript. These flaws specifically exist in the way the software handles the destruction of annotations from inside event handlers.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Endpoint security: Querying Tips for security and IT operations",
    "link": "https://blogs.cisco.com/security/getting-more-value-from-your-endpoint-security-tool-2-querying-tips-for-security-and-it-operations",
    "summary": "Cisco Orbital Advanced Search has an entire section of its Catalog dedicated to Threat Hunting, mapped to the MITRE ATT&CK™ framework, allowing you to query your endpoints for malicious artifacts.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "North Korean Malicious Cyber Activity",
    "link": "https://www.us-cert.gov/ncas/current-activity/2020/05/12/north-korean-malicious-cyber-activity",
    "summary": "The Cybersecurity and Infrastructure Security Agency (CISA), the Federal Bureau of Investigation (FBI), and the Department of Defense (DoD) have identified three malware variants - COPPERHEDGE, TAINTEDSCRIBE, and PEBBLEDASH - used by the North Korean government. In addition, U.S.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Threat Spotlight: Astaroth - Maze of obfuscation and evasion reveals dark stealer",
    "link": "https://blog.talosintelligence.com/2020/05/astaroth-analysis.html",
    "summary": "Cisco Talos is detailing an information stealer, Astaroth, that has been targeting Brazil with a variety of lures, including COVID-19 for the past nine to 12 months. Astaroth implements a robust series of anti-analysis/evasion techniques, among the most thorough we've seen recently.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Context is Everything When it Comes to Securing Application Access",
    "link": "https://blogs.cisco.com/security/context-is-everything-when-it-comes-to-securing-application-access",
    "summary": "Cisco SecureX connects access controls across the workforce, workload, and workplace to help democratize our comprehensive zero-trust approach by removing the barriers between the teams responsible for each control.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Microsoft Releases May 2020 Security Updates",
    "link": "https://www.us-cert.gov/ncas/current-activity/2020/05/12/microsoft-releases-may-2020-security-updates",
    "summary": "Microsoft has released updates to address multiple vulnerabilities in Microsoft software. A remote attacker could exploit some of these vulnerabilities to take control of an affected system.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Vulnerability Spotlight: Code execution vulnerability in Microsoft Excel",
    "link": "https://blog.talosintelligence.com/2020/05/vuln-spotlight-excel-patch-tuesday-may-2020.html",
    "summary": "Cisco Talos recently discovered a code execution vulnerability in some versions of Microsoft Excel. An attacker could exploit this vulnerability by tricking the victim into opening a specially crafted Excel file, triggering a use-after-free condition and allowing them to execute remote code on the victim machine.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Cisco Email Security and SecureX: protecting against email threats",
    "link": "https://blogs.cisco.com/security/cisco-email-security-and-securex-protecting-against-email-threats-and-unnecessary-complexity",
    "summary": "Explore how organizations can effectively protect themselves against security threats but also against the complexity of managing disparate security products that can make it harder to establish and enforce integrated security workflows.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Keeping applications safe and secure in a time of remote work",
    "link": "https://blogs.cisco.com/security/keeping-applications-safe-and-secure-in-a-time-of-remote-work",
    "summary": "Businesses around the world have quickly moved to a remote worker initiative, with more users accessing critical workloads outside the traditional workplace than ever before. New attack vectors are inadvertently being introduced to businesses as users are accessing their workloads outside the traditional 4-walls of the workplace and the security protection those 4 walls provide.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Vulnerability Spotlight: Zoom Communications User Enumeration",
    "link": "https://blog.talosintelligence.com/2020/04/zoom-user-enumeration.html",
    "summary": "Today, Cisco Talos is disclosing a user enumeration vulnerability in Zoom Communications that could allow a malicious user to obtain a complete list of Zoom users inside a specific organization. There has been a lot of discussion around what is and is not a vulnerability and what security features should exist in video conferencing software. This is not the purpose of this blog. This disclosure is made in accordance with our vulnerability disclosure policy, in the interests of ensuring the security and privacy of users at-large against this information disclosure vulnerability.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Getting more value from your endpoint security tool #1: Querying Tips for security and IT operations",
    "link": "https://blogs.cisco.com/security/getting-more-value-from-your-endpoint-security-tool-1-querying-tips-for-security-and-it-operations",
    "summary": "In January 2020, we added a new endpoint detection & response (EDR) capability, Orbital Advanced Search to the AMP for Endpoints Advantage offering. It's a powerful tool and we want to be sure you feel empowered to take advantage of its full value - the same way I felt about all of those tools in my father's garage many years ago.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "PoetRAT: Python RAT uses COVID-19 lures to target Azerbaijan public and private sectors",
    "link": "https://blog.talosintelligence.com/2020/04/poetrat-covid-19-lures.html",
    "summary": "Cisco Talos has discovered a new malware campaign based on a previously unknown family we're calling \"PoetRAT.\" At this time, we do not believe this attack is associated with an already known threat actor. Our research shows the malware was distributed using URLs that mimic some Azerbaijan government domains, thus we believe the adversaries in this case want to target citizens of the country Azerbaijan, including private companies in the SCADA sector like wind turbine systems. The droppers are Microsoft Word documents that deploy a Python-based remote access trojan (RAT). We named this malware PoetRAT due to the various references to William Shakespeare, an English poet and playwright. The RAT has all the standard features of this kind of malware, providing full control of the compromised system to the operation. For exfiltration, it uses FTP, which denotes an intention to transfer large amounts of data.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "5 Questions to Ask Your Security Platform Vendor",
    "link": "https://blogs.cisco.com/security/5-questions-to-ask-your-security-platform-vendor",
    "summary": "CISO are always on the hunt for innovative solutions to solve their most pressing problems. They have been forced to choose their own adventure from an industry that's rife with incompatibility, running their operations across dozens of tools and a plethora of consoles that don't talk to each other.  And this, combined with unmet scores of policy updates, inevitably leaves vulnerabilities in different point solutions across the security ecosystem. The reality is that most organizations already have an abundance of point products designed to address specific challenges, but most of these products can't be easily integrated to fulfill a larger and more effective security strategy.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Microsoft Releases April 2020 Security Updates",
    "link": "https://www.us-cert.gov/ncas/current-activity/2020/04/14/microsoft-releases-april-2020-security-updates",
    "summary": "Microsoft has released updates to address multiple vulnerabilities in Microsoft software. A remote attacker could exploit some of these vulnerabilities to take control of an affected system. The Cybersecurity and Infrastructure Security Agency (CISA) encourages users and administrators to review Microsoft's April 2020 Security Update Summary and Deployment Information and apply the necessary updates.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Quarterly Report: Incident Response trends in Spring 2020",
    "link": "https://blog.talosintelligence.com/2020/04/IR-quarterly-threat-report-spring-2020.html",
    "summary": "Cisco Talos Incident Response (CTIR) engagements continue to be dominated by ransomware and commodity trojans. As alluded to in last quarter's report, ransomware actors have begun threatening to release sensitive information from victims as a means of further compelling them to pay. Additionally, DDoS and coinminer threats reemerged in spring 2020 after absences in the previous quarter. Looking at information from November 2019 through January 2020, ransomware maintains its status as the most prevalent threat, and CTIR has observed some changes in the top ransomware offender - Ryuk.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Threats Can Be Anywhere: Modernize Your Data Center Security",
    "link": "https://blogs.cisco.com/security/threats-can-be-anywhere-modernize-your-data-center-security",
    "summary": "Virtualization, cloud, and software-defined networking are redefining the modern data center. There is a huge influx of data, from big data analytics and new types of applications. Workloads are even more dynamic than before, spanning across multiple physical data center locations and across public, private, and hybrid cloud environments. This spread of data creates a \"new\" perimeter outside of your traditional data center premises and can increase data theft opportunities. You could thus be challenged with where and how to secure your data center.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Microsoft Patch Tuesday - April 2020: Vulnerability disclosures and Snort coverage",
    "link": "https://blog.talosintelligence.com/2020/04/microsoft-patch-tuesday-april-2020.html",
    "summary": "Microsoft released its monthly security update today, disclosing vulnerabilities across many of its products and releasing corresponding updates. This month's Patch Tuesday covers 115 vulnerabilities. Nineteen of the flaws Microsoft disclosed are considered critical. The remainders are scored as being \"important\" updates.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Buyers Beware: Scamming Is Rife, Especially In a Time of Crisis",
    "link": "https://blogs.cisco.com/security/buyers-beware-scamming-is-rife-especially-in-a-time-of-crisis",
    "summary": "For years, scammers have been using a combination of Blackhat SEO techniques, phishing sites and newsworthy events to either trick individuals into giving up personal information including credit card numbers or to install malware or both. Preying on an individual's fears has always been a go to tactic for scammers.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Microsoft Releases April 2020 Security Updates",
    "link": "https://www.us-cert.gov/ncas/current-activity/2020/04/14/microsoft-releases-april-2020-security-updates",
    "summary": "Microsoft has released updates to address multiple vulnerabilities in Microsoft software. A remote attacker could exploit some of these vulnerabilities to take control of an affected system. The Cybersecurity and Infrastructure Security Agency (CISA) encourages users and administrators to review Microsoft's April 2020 Security Update Summary and Deployment Information and apply the necessary updates.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Fingerprint cloning: Myth or reality?",
    "link": "https://blog.talosintelligence.com/2020/04/fingerprint-research.html",
    "summary": "Passwords are the traditional authentication methods for computers and networks. But passwords can be stolen. Biometric authentication seems the perfect solution for that problem. There are several kinds of biometric authentication, including retina scanning, facial recognition and fingerprint authentication, the most common one. Everyone's fingerprints are unique, and it is commonly accepted that they can identify a person without being reproduced.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "IC3 Releases Alert on Extortion Email Scams",
    "link": "https://www.us-cert.gov/ncas/current-activity/2020/04/21/ic3-releases-alert-extortion-email-scams",
    "summary": "The Internet Crime Complaint Center (IC3) has released an alert warning of a recent increase in extortion email scams. Cyber criminals threaten to release sexually explicit photos or videos of victims unless they agree to send payment.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "How to Monitor VPN Split Tunneling and Remote Endpoints with Existing Infrastructure",
    "link": "https://blogs.cisco.com/security/how-to-monitor-vpn-split-tunneling-and-remote-endpoints-with-existing-infrastructure",
    "summary": "Using AnyConnect for VPN? Got Splunk? If so, you have what you need to secure, monitor and gain detailed endpoint visibility to: Implement VPN split tunneling to alleviate VPN capacity constraints without sacrificing security; Monitor and further optimize traffic you put over your existing split tunnel deployment and; Analyze security behavior of remote endpoints, users and VPN \"top talkers\". This is particularly useful for remote work endpoints that were rapidly deployed with less stringent that normal security compliance testing.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "AZORult brings friends to the party",
    "link": "https://blog.talosintelligence.com/2020/04/azorult-brings-friends-to-party.html",
    "summary": "Attackers are constantly reinventing ways of monetizing their tools. Cisco Talos recently discovered a complex campaign with several different executable payloads, all focused on providing financial benefits for the attacker in a slightly different way. The first payload is a Monero cryptocurrency miner based on XMRigCC, and the second is a trojan that monitors the clipboard and replaces its content. There's also a variant of the infamous AZORult information-stealing malware, a variant of Remcos remote access tool and, finally, the DarkVNC backdoor trojan.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Google Releases Security Updates",
    "link": "https://www.us-cert.gov/ncas/current-activity/2020/04/16/google-releases-security-updates",
    "summary": "Google has released Chrome version 81.0.4044.113 for Windows, Mac, and Linux. This version addresses a vulnerability that an attacker could exploit to take control of an affected system. The Cybersecurity and Infrastructure Security Agency (CISA) encourages users and administrators to review the Chrome Release and apply the necessary updates.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "The Firewall: The foundation for a robust Security Platform",
    "link": "https://blogs.cisco.com/security/the-firewall-the-foundation-for-a-robust-security-platform",
    "summary": "After many years of a strong preference for 'best of breed' security tools, the tides are turning. There's growing fatigue of the operational downsides - managing countless alerts and manually correlating threats, for example - inherent in this approach. Security products today need to include out-of-box integrations, interoperate with third-party solutions, share threat and contextual information, leverage automation, and above all else, simplify operations. This trend has a name: the security platform.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Expanding Free Security Offers into Customers' Endpoints",
    "link": "https://blogs.cisco.com/security/expanding-free-security-offers-into-customers-endpoints",
    "summary": "A few weeks ago, we shared that Cisco would provide extended free licenses and expanded usage counts at no extra charge for three of our key security technologies that are designed to protect remote workers: DNS-layer security from Cisco Umbrella, zero-trust security from Duo and secure network access from AnyConnect. As a result of this, there has been a huge demand for these technologies. Cisco has supported an additional 9 million-plus users during this crisis with this rollout.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Adobe Releases Security Updates for Multiple Products",
    "link": "https://www.us-cert.gov/ncas/current-activity/2020/04/14/adobe-releases-security-updates-multiple-products",
    "summary": "Adobe has released security updates to address vulnerabilities in multiple products. An attacker could exploit some of these vulnerabilities to take control of an affected system.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Trickbot: A primer",
    "link": "https://blog.talosintelligence.com/2020/03/trickbot-primer.html",
    "summary": "In recent years, the modular banking trojan known as Trickbot has evolved to become one of the most advanced trojans in the threat landscape. It has gone through a diverse set of changes since it was first discovered in 2016, including adding features that focus on Windows 10 and modules that target point of sale (POS) systems. Not only does it function as a standalone trojan, Trickbot is also commonly used as a dropper for other malware such as the Ryuk ransomware. The wide range of functionality allows this malware to adapt to different environments and maximize effectiveness in a compromised network.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Vulnerability Spotlight: Intel Raid Web Console 3 denial-of-service bugs",
    "link": "https://blog.talosintelligence.com/2020/03/vulnerability-spotlight-intel-raid-web-march-2020.html",
    "summary": "Cisco Talos recently discovered two denial-of-service vulnerabilities in the web API functionality of Intel RAID Web Console 3. The Raid Web Console is a web-based application that provides several configuration functions for the Intel RAID line of products, which includes controllers and storage expanders. The console monitors, maintains and troubleshoots these products. An attacker could exploit both of these bugs by sending a malicious POST request to the API.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Zero chance of tackling zero trust without a platform approach",
    "link": "https://blogs.cisco.com/security/zero-chance-of-tackling-zero-trust-without-a-platform-approach",
    "summary": "Zero trust has gone mainstream. Everyone’s either promoting the concept, offering solutions to address the challenge, or just wanting to understand what it’s all about. And that’s the trouble: it means different things to different people, especially the word “trust,” which is a loaded term in security.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "CISCO_BLOG",
    "title": "Stealing passwords with credential dumping",
    "link": "https://blogs.cisco.com/security/stealing-passwords-with-credential-dumping",
    "summary": "What's the quickest way to access a computer? Logging in. As obvious as this may sound, it's worth reflecting on this. Because while logging in is so second nature that you probably don't give it much consideration, it's also one of the most common techniques for taking over a computer.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "US_CERT",
    "title": "Microsoft RCE Vulnerabilities Affecting Windows, Windows Server",
    "link": "https://www.us-cert.gov/ncas/current-activity/2020/03/23/microsoft-rce-vulnerabilities-affecting-windows-windows-server",
    "summary": "Microsoft has released a security advisory to address remote code execution vulnerabilities in Adobe Type Manager Library affecting all currently supported versions of Windows and Windows Server operating systems. A remote attacker can exploit these vulnerabilities to take control of an affected system. Microsoft is aware of limited, targeted attacks exploiting these vulnerabilities in the wild.",
    "date": "2021-02-01T00:00:00.001Z"
  },
  {
    "sourceId": "TALOS_BLOG",
    "title": "Vulnerability Spotlight: Information disclosure in Windows 10 Kernel",
    "link": "https://blog.talosintelligence.com/2020/03/vuln-spotlight-windows-10-kernel-information-disclosure.html",
    "summary": "Cisco Talos recently discovered an information disclosure vulnerability in the Windows 10 kernel. An attacker could exploit this vulnerability by tricking the victim into opening a specially crafted executable, causing an out-of-bounds read, which leads to the disclosure of sensitive information. Microsoft disclosed and patched this bug as part of their monthly security update Tuesday.",
    "date": "2021-02-01T00:00:00.001Z"
  }
]
